re-former/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at", "password_digest") VALUES ('james', 'ddhw.dd@gmail.com', NULL, '2025-06-07 03:36:24.067236', '2025-06-07 03:36:24.067236', '$2a$12$6a/mFUTiFV/Iw8PDO3UVtuaXPiJVII4f4TtBeSwHdlPEt3iTr2.7K') RETURNING "id"

  def index
    @users = User.all
---
SELECT "users".* FROM "users"