private-events/app/controllers/attendances_controller.rb

INSERT INTO "attendances" ("created_at", "updated_at", "user_id", "event_id") VALUES ('2025-06-11 22:51:02.083229', '2025-06-11 22:51:02.083229', 2, 1) RETURNING "id"
---
  def create
    @attendance = current_user.attendances.build(event: @event)

    if @attendance.save

SELECT "events".* FROM "events" WHERE "events"."id" = 1 LIMIT 1
---
  def set_event
    @event = Event.find(params[:event_id])