private-events/app/controllers/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "creator_id", "name", "location", "date") VALUES ('2025-06-09 06:39:01.264997', '2025-06-09 06:39:01.264997', 1, 'sws', 'sss', '2025-06-09 06:38:00') RETURNING "id"
---
    def create
      @event = current_user.created_events.build(event_params)

      if @event.save